## ordinal number endcoding

In [2]:
import datetime

In [3]:
today_date=datetime.datetime.today()

In [4]:
today_date

datetime.datetime(2022, 7, 1, 20, 14, 31, 376267)

In [5]:
today_date-datetime.timedelta(1)

datetime.datetime(2022, 6, 30, 20, 14, 31, 376267)

In [6]:
#### list comprehension
days=[today_date-datetime.timedelta(x) for x in range(0,15)]

In [7]:
import pandas as pd
data=pd.DataFrame(days)
data.columns=["Day"]

In [8]:
data.head()

                         Day
0 2022-07-01 20:14:31.376267
1 2022-06-30 20:14:31.376267
2 2022-06-29 20:14:31.376267
3 2022-06-28 20:14:31.376267
4 2022-06-27 20:14:31.376267

In [9]:
data['weekday']=data['Day'].dt.day_name()
data.head()

                         Day    weekday
0 2022-07-01 20:14:31.376267     Friday
1 2022-06-30 20:14:31.376267   Thursday
2 2022-06-29 20:14:31.376267  Wednesday
3 2022-06-28 20:14:31.376267    Tuesday
4 2022-06-27 20:14:31.376267     Monday

In [10]:
dictionary={'Monday':1,'Tuesday':2,'Wednesday':3,'Thursday':4,'Friday':5,'Saturday':6,'Sunday':7
}

In [11]:
dictionary

{'Monday': 1,
 'Tuesday': 2,
 'Wednesday': 3,
 'Thursday': 4,
 'Friday': 5,
 'Saturday': 6,
 'Sunday': 7}

In [12]:
data['weekday_ordinal']=data['weekday'].map(dictionary)

In [13]:
data

                          Day    weekday  weekday_ordinal
0  2022-07-01 20:14:31.376267     Friday                5
1  2022-06-30 20:14:31.376267   Thursday                4
2  2022-06-29 20:14:31.376267  Wednesday                3
3  2022-06-28 20:14:31.376267    Tuesday                2
4  2022-06-27 20:14:31.376267     Monday                1
5  2022-06-26 20:14:31.376267     Sunday                7
6  2022-06-25 20:14:31.376267   Saturday                6
7  2022-06-24 20:14:31.376267     Friday                5
8  2022-06-23 20:14:31.376267   Thursday                4
9  2022-06-22 20:14:31.376267  Wednesday                3
10 2022-06-21 20:14:31.376267    Tuesday                2
11 2022-06-20 20:14:31.376267     Monday                1
12 2022-06-19 20:14:31.376267     Sunday                7
13 2022-06-18 20:14:31.376267   Saturday                6
14 2022-06-17 20:14:31.376267     Friday                5

#### Count or Frequency Encoding

In [14]:
train_set = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data' , header = None,index_col=None) 
train_set.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [15]:
len(train_set[1].unique())

9

In [16]:
columns=[1,3,5,6,7,8,9,13]
train_set=train_set[columns]

In [17]:
train_set.columns=['Employmnet','Degree','Status','Designation','family_job','Race','Sex','Country']

In [18]:
train_set.head()

,Employmnet,Degree,Status,Designation,family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba

In [19]:
for feature in train_set.columns[:]:
    print(feature,":",len(train_set[feature].unique()),'labels')

Employmnet : 9 labels
Degree : 16 labels
Status : 7 labels
Designation : 15 labels
family_job : 6 labels
Race : 5 labels
Sex : 2 labels
Country : 42 labels

In [20]:
train_set['Country'].value_counts()

 United-States                 29170
 Mexico                          643
 ?                               583
 Philippines                     198
 Germany                         137
 Canada                          121
 Puerto-Rico                     114
 El-Salvador                     106
 India                           100
 Cuba                             95
 England                          90
 Jamaica                          81
 South                            80
 China                            75
 Italy                            73
 Dominican-Republic               70
 Vietnam                          67
 Guatemala                        64
 Japan                            62
 Poland                           60
 Columbia                         59
 Taiwan                           51
 Haiti                            44
 Iran                             43
 Portugal                         37
 Nicaragua                        34
 Peru                             31
 France                           29
 Greece                           29
 Ecuador                          28
 Ireland                          24
 Hong                             20
 Cambodia                         19
 Trinadad&Tobago                  19
 Laos                             18
 Thailand                         18
 Yugoslavia                       16
 Outlying-US(Guam-USVI-etc)       14
 Honduras                         13
 Hungary                          13
 Scotland                         12
 Holand-Netherlands                1
Name: Country, dtype: int64

In [21]:
country_map=train_set['Country'].value_counts().to_dict()

In [22]:
train_set['Country']=train_set['Country'].map(country_map)

In [23]:
train_set

,Employmnet,Degree,Status,Designation,family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,29170
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,29170
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,29170
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,95
...,...,...,...,...,...,...,...,...
32556,Private,Assoc-acdm,Married-civ-spouse,Tech-support,Wife,White,Female,29170
32557,Private,HS-grad,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,29170
32558,Private,HS-grad,Widowed,Adm-clerical,Unmarried,White,Female,29170
32559,Private,HS-grad,Never-married,Adm-clerical,Own-child,White,Male,29170
32560,Self-emp-inc,HS-grad,Married-civ-spouse,Exec-managerial,Wife,White,Female,29170

#### Advantages
1. Easy to use
2. not increasing feature space
#### Disadvantages
1. it will provide samen weight if the frequencies are same

#### Target  Guided ordinal encoding
1. Ordering the labels according to target
2. Replace the labels by the joint probability of being o or 1

In [24]:
import pandas as pd
df=pd.read_csv('titanic.csv',usecols=['Cabin','Survived'])
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [25]:
df['Cabin'].isnull().sum()

687

In [26]:
df['Cabin'].fillna('Missing',inplace=True)

In [27]:
df['Cabin'].head()

0    Missing
1        C85
2    Missing
3       C123
4    Missing
Name: Cabin, dtype: object

In [28]:
df['Cabin']=df['Cabin'].astype(str).str[0]

df.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [29]:
df.Cabin.unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

KeyError: "['cabin'] not found in axis"

In [31]:
df.groupby(['Cabin'])['Survived'].mean()

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
M    0.299854
T    0.000000
Name: Survived, dtype: float64

In [33]:
df.groupby(['Cabin'])['Survived'].mean().sort_values().index

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [34]:
ordinal_labels=df.groupby(['Cabin'])['Survived'].mean().sort_values().index
ordinal_labels

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [38]:
ordinal_labels2={k:i for i,k in enumerate(ordinal_labels,0)}
ordinal_labels2

{'T': 0, 'M': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [39]:
df['Cabin_ordinal_labels']=df['Cabin'].map(ordinal_labels2)

In [40]:
df

     Survived Cabin  Cabin_ordinal_labels
0           0     M                     1
1           1     C                     4
2           1     M                     1
3           1     C                     4
4           0     M                     1
..        ...   ...                   ...
886         0     M                     1
887         1     B                     6
888         0     M                     1
889         1     C                     4
890         0     M                     1

[891 rows x 3 columns]